[
  {
    "id": "f89c0945-ab01-4ec0-bfed-65a096cee9be",
    "userId": "user_300PtmuW7mBNpjEdfKzjozU4kY4",
    "jobTitle": "JD .Net Developer template",
    "questionType": "behavioral",
    "level": "junior",
    "questions": [
      "1. Can you describe a time when you had to quickly learn a new technology or programming language during your studies or previous internship?",
      "2. Tell me about a situation where you collaborated with others on a software project and how you contributed to the team’s success.",
      "3. How do you handle feedback or criticism on your code from more experienced developers or mentors?",
      "4. Share an experience where you faced a challenging bug or issue in your code and how you worked towards solving it.",
      "5. Can you give an example of how you managed your time to meet a deadline for a project or assignment?",
      "6. Describe a moment when you had to adapt to changes in project requirements or priorities. How did you respond?",
      "7. Have you ever participated in code reviews? What did you learn from receiving or giving feedback during those sessions?",
      "8. Tell me about a time you had to balance multiple tasks or responsibilities—how did you prioritize and organize your work?",
      "9. How do you approach learning new frameworks or tools, such as .NET technologies or RESTful services, when you have limited prior experience?",
      "10. Can you share a story where you supported a teammate who was struggling with a complex coding task?",
      "11. Describe how you ensure your code is user-friendly and visually appealing, even when working under pressure.",
      "12. Have you ever received constructive criticism about your communication skills? How did you use that feedback to improve?",
      "13. Tell me about a time you worked in a group setting and had to resolve a disagreement or conflict—what steps did you take?",
      "14. When you encounter something you don’t understand in your work or studies, what steps do you take to find a solution?",
      "15. Can you provide an example of how you’ve demonstrated flexibility or willingness to take on a new challenge outside your comfort zone?"
    ],
    "originalJDText": "会社概要 /Company Profile 企業名 /Company Name 業種 /Industry 設立/Established in 2018/09 代表者氏名 /Representative Mr. NguyenLamThao 住所 /Address 従業員数 /Company size < 50 người 事業内容 / 会社の特徴 Introduce about the company ポジション /Position 配属部署 /Assigned department 勤務地 /Place of work 雇用形態 /Position type 採用人数 /Number of hires 2 người キャリアレベル  Career level 給料 /Salary 年齢、性別 /Age, Gender 業務内容 / Job Description 必須要件 【要求される職務経験、ス キル】 /Required experiences  and skills 歓迎 / 尚可 /Welcome/ a plus 学歴 /Education Level 必要な免許・資格 / Qualifications 就業時期 /Working Time  待遇・福利厚生 / Benefit その他 /Other 外国語能力 /Foreign languages Technology OneTech Asia Joint Stock (OneTech Asia) Website: https://onetech.vn    求人内容  /Job Requirements • Trình độ nâng cao về C#, F#, hoặc VB.NET; tốt nhất là cả ba. Tiếng Anh Tốt nghiệp Đại học/ Cao đẳng Chứng chỉ MCSD hoặc MCPD là một lợi thế Thời gian làm việc: Từ thứ Hai đến thứ Sáu: 08h – 17h00;  •  L ư ơng  t ừ   800  ~  1500 USD .  ( t h o ả   thuận theo  n ă ng  l ự c ) . •  Lương tháng  13 . •  Hưởng đầy đủ chính sách bảo hiểm theo quy định của pháp luật Nhà nước . •  Môi trường làm việc trẻ ,  thân thiện ,  năng động . •  Được phép làm việc từ xa  1  ngày /  tháng . •  Khám sức khỏe định kỳ . •  Teambuilding ,  du  l ị ch hằng  n ă m . Grow Up JV Co., Ltd  3rd Floor, QCOOP Building, No. 647 Ly Thuong Kiet, Ward 11, Tan Binh District, HCMC Tel: (+84)353-253-373 Email: sales@growupwork.com    Website: https://growupwork.com 20/8/2021 求 人 票/ JOB ORDER Lý Thường Kiệt, Phường 11, Quận Tân Bình, TP.HCM ONETECH ASIA là công ty chuyên nghiên cứu và phát triển sản phẩm phần mềm trên nền tảng mobile app,  games, web cho thị trường Nhật Bản, Châu Á và thế giới. OneTech Asia luôn đi đầu và không ngừng nghiên  cứu, phát triển sản phẩm dựa trên những công nghệ mới như ứng dụng Hololens, AR/VR/MR, Drone, IoT,  Robot và AI. .NET Developer  Lý Thường Kiệt, Phường 11, Quận Tân Bình, TP.HCM fulltime Junior/middle/senior $800 ~ 1500 Không yêu cầu • Sử dụng cơ sở hạ tầng .NET của Microsoft để tạo ra các giải pháp phần mềm đáp ứng yêu cầu của khách hàng. • Phối hợp với đồng nghiệp để tạo điều kiện thuận lợi cho việc tạo ra các phát triển lớn, phức tạp theo yêu cầu. • Sửa đổi mã hiện có để đảm bảo tuân thủ các hướng dẫn đã quy định. • Kiểm tra mã của bạn để phát hiện và khắc phục các lỗi và thiếu sót. • Kiểm tra kết quả đầu ra của bạn để đảm bảo rằng chúng hoạt động tốt. • Đảm bảo rằng đầu ra hấp dẫn trực quan, thân thiện với người dùng và hấp dẫn. • Triển khai các diễn biến và theo dõi sự tiếp thu của đối tượng mục tiêu. • Hỗ trợ các thành viên trong nhóm với các chức năng phức tạp, tham gia nhận xét, đánh giá source code của  các thành viên trong nhóm. • Bằng Cử nhân về CNTT / Khoa học Máy tính. • Có ít nhất 1 năm kinh nghiệm với tư cách là Nhà phát triển .NET. • Kiến thức chuyên sâu về hạ tầng .NET. • Thành thạo lập trình .NET Webform, Winform hoặc C#, ASP.NET MVC/ MVC5. • Nắm vững lập trình OOP, MVC. • Khả năng sử dụng SQL hoặc Oracle một cách dễ dàng. • Có kiến thức tốt về RESTful service/ Web API. • Có kiến thức tốt về HTML, CSS, Javascript/ JQuery/ Bootstrap. • Kỹ năng phân tích, giải quyết vấn đề và giao tiếp vượt trội. • Kỹ năng tổ chức và quản lý thời gian xuất sắc. • Tự định hướng, linh hoạt và đổi mới.",
    "fileName": "JD .Net Developer template.pdf",
    "createdAt": "2025-09-15T08:31:41.686Z",
    "updatedAt": "2025-09-15T08:31:41.686Z"
  },
  {
    "id": "93b664e6-3881-4826-aacb-b3ff8755deee",
    "userId": "user_32k8QuJ9wft1xy8ITCsj4IlzqfG",
    "jobTitle": "JD .Net Developer template",
    "questionType": "technical",
    "level": "junior",
    "questions": [
      "1. What is the basic syntax to declare a variable in C#?",
      "2. Can you explain the difference between Winform and Webform in .NET?",
      "3. What is the role of the MVC pattern in ASP.NET MVC applications?",
      "4. How would you connect to a SQL database from a .NET application?",
      "5. What is a RESTful service, and how do you consume it in .NET?",
      "6. How do you apply a CSS class to an HTML element?",
      "7. What is the purpose of JQuery, and how would you use it to hide an element on a page?",
      "8. How does Bootstrap help in web development?",
      "9. What is the difference between SQL and Oracle databases?",
      "10. What are some core concepts of Object-Oriented Programming (OOP)?",
      "11. How would you create a simple Web API endpoint in ASP.NET MVC5?",
      "12. How do you perform form validation in ASP.NET Webform?",
      "13. What is the purpose of using F# or VB.NET in the .NET ecosystem?",
      "14. How would you modify existing code to comply with given coding guidelines?"
    ],
    "originalJDText": "会社概要 /Company Profile 企業名 /Company Name 業種 /Industry 設立/Established in 2018/09 代表者氏名 /Representative Mr. NguyenLamThao 住所 /Address 従業員数 /Company size < 50 người 事業内容 / 会社の特徴 Introduce about the company ポジション /Position 配属部署 /Assigned department 勤務地 /Place of work 雇用形態 /Position type 採用人数 /Number of hires 2 người キャリアレベル  Career level 給料 /Salary 年齢、性別 /Age, Gender 業務内容 / Job Description 必須要件 【要求される職務経験、ス キル】 /Required experiences  and skills 歓迎 / 尚可 /Welcome/ a plus 学歴 /Education Level 必要な免許・資格 / Qualifications 就業時期 /Working Time  待遇・福利厚生 / Benefit その他 /Other 外国語能力 /Foreign languages Technology OneTech Asia Joint Stock (OneTech Asia) Website: https://onetech.vn    求人内容  /Job Requirements • Trình độ nâng cao về C#, F#, hoặc VB.NET; tốt nhất là cả ba. Tiếng Anh Tốt nghiệp Đại học/ Cao đẳng Chứng chỉ MCSD hoặc MCPD là một lợi thế Thời gian làm việc: Từ thứ Hai đến thứ Sáu: 08h – 17h00;  •  L ư ơng  t ừ   800  ~  1500 USD .  ( t h o ả   thuận theo  n ă ng  l ự c ) . •  Lương tháng  13 . •  Hưởng đầy đủ chính sách bảo hiểm theo quy định của pháp luật Nhà nước . •  Môi trường làm việc trẻ ,  thân thiện ,  năng động . •  Được phép làm việc từ xa  1  ngày /  tháng . •  Khám sức khỏe định kỳ . •  Teambuilding ,  du  l ị ch hằng  n ă m . Grow Up JV Co., Ltd  3rd Floor, QCOOP Building, No. 647 Ly Thuong Kiet, Ward 11, Tan Binh District, HCMC Tel: (+84)353-253-373 Email: sales@growupwork.com    Website: https://growupwork.com 20/8/2021 求 人 票/ JOB ORDER Lý Thường Kiệt, Phường 11, Quận Tân Bình, TP.HCM ONETECH ASIA là công ty chuyên nghiên cứu và phát triển sản phẩm phần mềm trên nền tảng mobile app,  games, web cho thị trường Nhật Bản, Châu Á và thế giới. OneTech Asia luôn đi đầu và không ngừng nghiên  cứu, phát triển sản phẩm dựa trên những công nghệ mới như ứng dụng Hololens, AR/VR/MR, Drone, IoT,  Robot và AI. .NET Developer  Lý Thường Kiệt, Phường 11, Quận Tân Bình, TP.HCM fulltime Junior/middle/senior $800 ~ 1500 Không yêu cầu • Sử dụng cơ sở hạ tầng .NET của Microsoft để tạo ra các giải pháp phần mềm đáp ứng yêu cầu của khách hàng. • Phối hợp với đồng nghiệp để tạo điều kiện thuận lợi cho việc tạo ra các phát triển lớn, phức tạp theo yêu cầu. • Sửa đổi mã hiện có để đảm bảo tuân thủ các hướng dẫn đã quy định. • Kiểm tra mã của bạn để phát hiện và khắc phục các lỗi và thiếu sót. • Kiểm tra kết quả đầu ra của bạn để đảm bảo rằng chúng hoạt động tốt. • Đảm bảo rằng đầu ra hấp dẫn trực quan, thân thiện với người dùng và hấp dẫn. • Triển khai các diễn biến và theo dõi sự tiếp thu của đối tượng mục tiêu. • Hỗ trợ các thành viên trong nhóm với các chức năng phức tạp, tham gia nhận xét, đánh giá source code của  các thành viên trong nhóm. • Bằng Cử nhân về CNTT / Khoa học Máy tính. • Có ít nhất 1 năm kinh nghiệm với tư cách là Nhà phát triển .NET. • Kiến thức chuyên sâu về hạ tầng .NET. • Thành thạo lập trình .NET Webform, Winform hoặc C#, ASP.NET MVC/ MVC5. • Nắm vững lập trình OOP, MVC. • Khả năng sử dụng SQL hoặc Oracle một cách dễ dàng. • Có kiến thức tốt về RESTful service/ Web API. • Có kiến thức tốt về HTML, CSS, Javascript/ JQuery/ Bootstrap. • Kỹ năng phân tích, giải quyết vấn đề và giao tiếp vượt trội. • Kỹ năng tổ chức và quản lý thời gian xuất sắc. • Tự định hướng, linh hoạt và đổi mới.",
    "fileName": "JD .Net Developer template.pdf",
    "createdAt": "2025-09-17T03:23:56.252Z",
    "updatedAt": "2025-09-17T03:23:56.252Z"
  },
  {
    "id": "17636593-52d5-43d8-8aac-394213f6402e",
    "userId": "user_313ZeZOuWsLXwB1idH5qqLXETcf",
    "jobTitle": "JD Mobile Developer template",
    "questionType": "technical",
    "level": "junior",
    "questions": [
      "1. What is the difference between Java and Kotlin when developing Android applications?",
      "2. Can you explain a simple \"Hello World\" program in C++?",
      "3. How do you start a new Android project in Android Studio?",
      "4. What are the main programming languages used for iOS app development?",
      "5. What is the role of an SDK in mobile app development?",
      "6. How would you define a layout in an Android application?",
      "7. What is a thread, and why is it important in mobile app development?",
      "8. Can you describe what an Android service is and give a basic use case?",
      "9. What is a broadcast receiver in Android, and when would you use it?",
      "10. How do you create a custom view in Android?",
      "11. How can you integrate Facebook login into your mobile app using its API?",
      "12. What is the importance of UI/UX design in mobile application development?"
    ],
    "originalJDText": "会社概要 /Company Profile 企業名 /Company Name 業種 /Industry 設立/Established in 2018/09 代表者氏名 /Representative Mr. NguyenLamThao 住所 /Address 従業員数 /Company size < 50 người 事業内容 / 会社の特徴 Introduce about the company ポジション /Position 配属部署 /Assigned department 勤務地 /Place of work 雇用形態 /Position type 採用人数 /Number of hires 2 người キャリアレベル  Career level 給料 /Salary 年齢、性別 /Age, Gender 業務内容 / Job Description 必須要件 【要求される職務経験、ス キル】 /Required experiences  and skills 歓迎 / 尚可 /Welcome/ a plus 学歴 /Education Level 必要な免許・資格 / Qualifications 就業時期 /Working Time  待遇・福利厚生 / Benefit その他 /Other 外国語能力 /Foreign languages Technology OneTech Asia Joint Stock (OneTech Asia) Website: https://onetech.vn    求人内容  /Job Requirements Tiếng Anh Tốt nghiệp Đại học/ Cao đẳng Thời gian làm việc: Từ thứ Hai đến thứ Sáu: 08h – 17h00;  •  L ư ơng  t ừ   800  ~  1200 USD .  ( t h o ả   thuận theo  n ă ng  l ự c ) •  T h ư ở ng theo  d ự   á n  ( m ứ c  t h ư ở ng  d ự a  t r ê n  m ứ c  đ ộ   c ố ng  h i ế n ,  doanh thu  c ủ a  d ự   á n ) . •  L ư ơng  t h á ng  13 . •  X é t  t ă ng  l ư ơng  d ự a  t r ê n  n ă ng  l ự c  &  tinh  t h ầ n  l à m  v i ệ c  ( s ố   l ầ n  t ă ng  l ư ơng trong  n ă m  k h ô ng quy  đ ị nh  c ụ   t h ể ) . •  N g h ỉ   t h ứ   7 ,   C  h ủ   Nhật ,  l ễ ,  t ế t theo  đ ú ng  p h á p luật  ( n ế u  d ự   á n  g ấ p  c ó   t h ể   OT ) . •  BHXH ,  c á c  l o ạ i  t h u ế   theo  đ ú ng  p h á p luật . •  Hỗ trợ đào tạo tại Nhật Bản •  Teambuilding ,  du  l ị ch hằng  n ă m . Grow Up JV Co., Ltd                               3rd Floor, QCOOP Building, No. 647 Ly Thuong Kiet, Ward 11, Tan Binh District, HCMC Tel: (+84)353-253-373 Email: sales@growupwork.com    Website: https://growupwork.com 20/8/2021 求 人 票/ JOB ORDER Lý Thường Kiệt, Phường 11, Quận Tân Bình, TP.HCM ONETECH ASIA là công ty chuyên nghiên cứu và phát triển sản phẩm phần mềm trên nền tảng mobile app,  games, web cho thị trường Nhật Bản, Châu Á và thế giới. OneTech Asia luôn đi đầu và không ngừng nghiên  cứu, phát triển sản phẩm dựa trên những công nghệ mới như ứng dụng Hololens, AR/VR/MR, Drone, IoT,  Robot và AI. Mobile Developer Development  Lý Thường Kiệt, Phường 11, Quận Tân Bình, TP.HCM fulltime Junior/middle/senior $ 800 ~ 1200 Không yêu cầu •  Lập trình  v i ê n Mobile Apps sử  d ụ ng  c ô ng nghệ IOS / Android . •  Tham gia phát  t r i ể n các ứng  d ụ ng  t r ê n nền hệ điều hành Android / IOS . •   C  ộ ng tác với Nhà thiết kế UI / UX cũng như tester ,  đ ể   đ ả m  b ả o rằng mỗi ứng  d ụ ng đều  c ó   t h ể   sử  d ụ ng được  và hoạt  đ ộ ng hoàn  h ả o . •  Tạo các  b ả n cập nhật ứng  d ụ ng ,  bao gồm các  b ả n sửa lỗi và các tính  n ă ng bổ sung ,  đ ể   phát hành . •  Làm việc ,  phối hợp  c ô ng việc theo  n h ó m dưới  s ự   phân  c ô ng  c ô ng việc  c ủ a  q u ả n lý  d ự   án . •  Bằng Cử nhân về CNTT  /  Khoa học Máy tính . •  Từ  1  năm kinh nghiệm phát triển mobile app •  Kiến thức thành thạo về các ngôn ngữ máy tính liên quan cho các thiết bị Android ,  iOS và Windows . •  Thành thạo Java ,  Kotlin hoặc C  ++.  •  K h ả   n ă ng sử  d ụ ng các thư viện và SDK hỗ trợ . •  Thành thạo xử lý layout ,  thread ,  service ,  broadcast receiver ,  custom views … . •   C  ó   kinh nghiệm làm việc với Social network API  ( Facebook ,  Google … ) •  Kỹ  n ă ng giao tiếp bằng lời tốt . •   C  h ủ   đ ộ ng  c ô ng việc ,  c ó   kỹ  n ă ng làm việc  n h ó m .",
    "fileName": "JD Mobile Developer template.pdf",
    "createdAt": "2025-09-20T06:03:43.806Z",
    "updatedAt": "2025-09-20T06:03:43.806Z"
  },
  {
    "id": "d305f642-c26b-4478-8e2d-06cbb742f05f",
    "userId": "user_2zwBUtNXF9oxWWHgyHy2NHUGPhh",
    "jobTitle": "JD AvePoint Danang Junior AI QA Engineer",
    "questionType": "technical",
    "level": "junior",
    "questions": [
      "1. What is the difference between AI and Machine Learning?",
      "2. Can you briefly explain what Natural Language Processing (NLP) is used for in AI applications?",
      "3. How would you use JIRA in a QA process?",
      "4. What is JMeter typically used for, and how would you apply it in performance testing?",
      "5. What is Selenium, and how can it help automate testing tasks?",
      "6. What is Cypress, and how does it differ from Selenium for automation testing?",
      "7. How do you declare a variable and print its value in JavaScript?"
    ],
    "originalJDText": "AvePoint  Vietnam   |  2F Vinh Trung Plaza, No. 255 - 257 Hung Vuong, Vinh Trung, Thanh Khe, Da Nang     JUNIOR   AI  QUALITY ASSURANCE  ENGINEER   YOUR RESPONSIBILITIES WILL  INCLUDE   •   Support Design & Execute Test Cases : Design and execute test cases for AI features,  including functional testing and non - functional testing (performance, security, scalability).   •   Support AI Model Testing : Participate in testing and evaluating machine learning models,  including tests for accuracy, stability, and fairness (bias).   •   Support Test & Analyze Results : Conduct system testing, identify bugs, and analyze test  results to pinpoint potential issues.   •   Support Test Automation : Support the QA team in developing and maintaining basic  automation test suites for AI functionalities.   •   Report Writing & Documentation : Write detailed reports on  discovered bugs, store, and  maintain testing documentation.   •   Ensure Data Quality : Test and evaluate the quality of input and output data for AI models,  identifying and reporting potential data - related issues.   JOB REQUIREMENTS   •   Bachelor’s Degree/Associate Degree : Relevant fields such as Information Technology,  Computer Science, or related disciplines.   •   Knowledge of AI/ML : Basic knowledge of AI concepts, machine learning (ML), and Natural  Language Processing (NLP) is a significant  advantage.   •   Strong Analytical Skills : Ability to analyze problems, identify root causes, and propose  solutions.   •   Communication Skills : Clear and effective communication skills to interact with  stakeholders.   •   Experience with Tools : Familiarity with project management tools such as JIRA,  performance testing tools like JMeter, LoadRunner.   •   Automation : Experience or basic knowledge of test automation (Automation Testing) using  frameworks such as Selenium, Cypress is a plus.   Preferred Skills   •   Ability to read and understand code (Python, JavaScript) to support source code testing is a  plus.    \n      AvePoint  Vietnam   |  2F Vinh Trung Plaza, No. 255 - 257 Hung Vuong, Vinh Trung, Thanh Khe, Da Nang     WORK LOCATION             2F  Vinh Trung  Plaza , No. 255 - 257 Hung Vuong, Vinh Trung, Thanh Khe, Da Nang   BENEFITS   •   5 - day   workweek   with   weekends   off   •   Dynamic,   professional   environment   with   career   growth   opportunities   •   Social,   medical,   and   unemployment   insurance   based   on   actual   salary   •   Performance   and   salary   review   twice   a   year   •   Quarterly bonus   opportunities   based   on   performance   •   Potential   for  international   onsite   assignments   •   Regular   team - building events   and   internal   activities   (weekly   happy   hour,   quarterly   team   building   events,   Lunar New Year parties,   etc.)     CONTACT   Nguyen   My Hien ( Sandra   Nguyen) < Sandra .Nguyen @avepoint.com >   0905   937 140",
    "fileName": "JD AvePoint Danang_Junior AI QA Engineer.pdf",
    "createdAt": "2025-09-20T06:04:39.260Z",
    "updatedAt": "2025-09-20T06:04:39.260Z"
  }
]